#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-oYcjApP3zf5t73Mk

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.sample_lambda.null_resource.build_lambda_function: Refreshing state... [id=8676610837358498503]
module.sample_s3_lambda.data.archive_file.source: Refreshing...
module.sample_s3_lambda.data.archive_file.source: Refresh complete after 0s [id=a8eb6da38c7e1d31adc2af363472a1d492c6220a]
module.sample_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.sample_s3_lambda.aws_s3_object.file_upload: Refreshing state... [id=sample_s3_lambda_lambda.zip]
module.sample_s3_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_lambda_s3]
module.s3_bucket.aws_s3_bucket.lambda_bucket: Refreshing state... [id=testing-submodules-resources]
module.sample_lambda.aws_lambda_function.hello-terraform: Refreshing state... [id=hello-terraform]
module.sample_s3_lambda.aws_lambda_function.lamba_s3_example: Refreshing state... [id=lambdaS3Example]
module.sample_s3_lambda.aws_lambda_function.lamba_s3_example: Drift detected (update)
module.sample_s3_lambda.aws_s3_object.file_upload: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.sample_lambda.null_resource.build_lambda_function must be replaced
-/+ resource "null_resource" "build_lambda_function" {
      ~ id       = "8676610837358498503" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build_number" = "2023-06-12T05:40:12Z" -> (known after apply)
        }
    }

  # module.sample_s3_lambda.aws_lambda_function.lamba_s3_example will be updated in-place
  ~ resource "aws_lambda_function" "lamba_s3_example" {
        id                             = "lambdaS3Example"
      ~ last_modified                  = "2023-06-12T05:40:13.736+0000" -> (known after apply)
      ~ s3_key                         = "sample_s3_lambda_lambda.zip" -> "sample_s3_lambda.zip"
      ~ source_code_hash               = "DU4gXeKXfGrd/ixOZY1W0SLEBlOZvCenmQYULk2BS7Q=" -> "8FK6xRtAlXqoSPOU2LiMGxadnPYFgVVtKe9x68MtGzU="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sample_s3_lambda.aws_s3_object.file_upload must be replaced
-/+ resource "aws_s3_object" "file_upload" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8d5a9d4a145192abcb6ffe34f2ce5b11" -> (known after apply)
      ~ id                     = "sample_s3_lambda_lambda.zip" -> (known after apply)
      ~ key                    = "sample_s3_lambda_lambda.zip" -> "sample_s3_lambda.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "./modules/lambdaexample/src/dist/lambda.zip" -> "./modules/lambdas3example/src/dist/lambda.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*